const NAMES = ['Александр', 'Кристина', 'Анна', 'Дмитрий', 'Дарья', 'Елизавета', 'Максим'];

const MESSAGES = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'
];

const DESCRIPTIONS = [
  'Мои выходные',
  'Отдыхаю с друзьями',
  'Это был лучший день в моей жизни!',
  'Сегодня радую вас красивой фотографией',
  'Настроение пообщаться в комментариях',
  'Жду ваших лайков :)'
];

const COUNT_PHOTO = 25;
const COUNT_COMMENT = 8;
const MAX_STRING_LENGTH = 140;
const MAX_COUNT_HASHTAGS = 5;

const CountLike = {
  MIN: 15,
  MAX: 200
};

const NumberAvatar = {
  MIN: 1,
  MAX: 6
};

export { NAMES, MESSAGES, DESCRIPTIONS, COUNT_PHOTO, COUNT_COMMENT, CountLike, NumberAvatar, MAX_STRING_LENGTH, MAX_COUNT_HASHTAGS };
